In [1]:
import pandas as pd

In [2]:
places_df = pd.read_csv('places_progress_bad_OG.csv')
places_df.shape

(9421, 5)

In [3]:
places_df = places_df.drop_duplicates()
places_df.shape

(7695, 5)

In [22]:
# duplicate_camis_values = places_df[places_df.duplicated(subset='camis', keep=False)]['camis']
# filtered_df = places_df[places_df['camis'].isin(duplicate_camis_values)]

In [5]:
places_df.shape

(7695, 5)

In [23]:
filtered_df.head()

,camis,place_id,display_name,formatted_address,note
33,41447792,ChIJm5XlqK9ZwokRskEZP6W-24c,fresh&co,"363 7th Ave, New York, NY 10001, USA",NaN
34,41447792,ChIJCSs__TZZwokRcz9q4h0Wyu8,fresh&co,"499 7th Ave, New York, NY 10018, USA",NaN
36,50118379,ChIJn7fRO5z3wokRsqLXcCKoz9M,Golden Dragon,"2060 Adam Clayton Powell Jr Blvd, New York, NY...",NaN
37,50118379,ChIJT6l5hHz2wokRWTEIvi-6L0A,New Golden Dragon,"398 W 145th St, New York, NY 10031, USA",NaN
64,50112714,ChIJPwdLUJVewokRgWn1UcUx0jU,56-27 58th St,"56-27 58th St, Queens, NY 11378, USA","Possible address only, no specific business match"

In [6]:
places_df.loc[:, 'street'] = places_df['formatted_address'].str.split(',').str[0]
places_df.head()

,camis,place_id,display_name,formatted_address,note,street
0,41168748,ChIJNzTkzav1wokRg3R8aGzuiWI,Dunkin',"In Sunoco Gas Station, 880 Garrison Ave, Bronx...",NaN,In Sunoco Gas Station
1,41688142,ChIJN0LWs0VawokRlblPt3vRdBU,Table 87,"87 Atlantic Ave, Brooklyn, NY 11201, USA",NaN,87 Atlantic Ave
2,50100336,ChIJv4RNXVdawokR2clhEV4tZ8A,Subway,"8711 3rd Ave, Brooklyn, NY 11209, USA",NaN,8711 3rd Ave
3,50086686,ChIJecXcbl9ZwokRKrDkbAar1eQ,GERTIE,"357 Grand St, Brooklyn, NY 11211, USA",NaN,357 Grand St
4,50081121,ChIJ93nHHvVdwokRWLG_CuQou6o,Dunkin',"2492 Linden Blvd, Brooklyn, NY 11208, USA",NaN,2492 Linden Blvd

In [7]:
places_df.shape

(7695, 6)

In [8]:
ny_df = pd.read_csv('clean_ny.csv')

In [9]:
# Creating a new DataFrame with the selected columns
selected_columns = ['camis', 'dba', 'boro', 'phone', 'full_address']
unique_ny_df = ny_df[selected_columns].drop_duplicates()
len(unique_ny_df), unique_ny_df.camis.nunique()

(25820, 25820)

In [10]:
unique_ny_df.head()

      camis       dba      boro       phone                 full_address
0  41168748    DUNKIN     Bronx  7188614171    880 GARRISON AVENUE 10474
1  41688142  TABLE 87  Brooklyn  9176186100    620 ATLANTIC AVENUE 11217
2  50100336    SUBWAY  Brooklyn  7186808808          8711 3 AVENUE 11209
3  50086686    GERTIE  Brooklyn  7186360902        58 MARCY AVENUE 11211
4  50081121    DUNKIN  Brooklyn  7182729090  2492 LINDEN BOULEVARD 11208

In [11]:
places_df.camis.nunique()

6589

In [13]:
# Create a separate copy to avoid SettingWithCopyWarning
places_df = places_df.copy()

for index, row in places_df.iterrows():
    camis = row['camis']
    street = row['street'].lower()
    
    # Find rows in unique_ny_df with the same camis
    matching_rows = unique_ny_df[unique_ny_df['camis'] == camis]
    
    # Check if the street is part of any full_address in matching_rows
    if not any(street in address.lower() for address in matching_rows['full_address']):
        places_df.drop(index, inplace=True)

In [19]:
places_df.shape, places_df.camis.nunique()

((2595, 6), 2578)

In [15]:
# Save the places_df DataFrame as a CSV file
places_df.to_csv('places_correct_addy.csv', index=False)

In [22]:
# Creating a new DataFrame with the selected columns
selected_columns = ['camis', 'place_id']
places_df_scrape = places_df[selected_columns].drop_duplicates(subset='camis')
len(places_df_scrape), places_df_scrape.camis.nunique()

(2578, 2578)

In [23]:
# Save the places_df DataFrame as a CSV file
places_df_scrape.to_csv('places_scrape_rdy.csv', index=False)

In [9]:
duplicate_camis = places_df[places_df.duplicated(subset='camis', keep=False)]
sorted_duplicates = duplicate_camis.sort_values(by='camis').reset_index(drop=True)
sorted_duplicates

,camis,place_id,display_name,formatted_address,note
0,40359705,ChIJQQaDPzVEwokRwJfPzNzyNnI,Nathan's Famous,"1310 Surf Ave, Brooklyn, NY 11224, USA",NaN
1,40359705,ChIJv58wAS5FwokR071pDE2VMIo,Nathan's Famous,"1205 Riegelmann Boardwalk, Brooklyn, NY 11224,...",NaN
2,40363834,ChIJEyE1BblOwokRcDFBxNSocqs,Carvel,"2590 Hylan Blvd, Staten Island, NY 10306, USA",NaN
3,40363834,ChIJZ9JH4-JOwokR9F9Jfcfhw3Q,Carvel,"1111 Hylan Blvd, Staten Island, NY 10305, USA",NaN
4,40364443,ChIJDTph0yBawokRlYyt-eYKDLQ,NYPD Manhattan Central Booking,"Manhattan Criminal Courthouse, 100 Centre St, ...",NaN
...,...,...,...,...,...
1423,50139434,ChIJFz6iQOVhwokRLchiouZFatE,Hong Kong Eats大家好港式茶餐厅,"44-12 Kissena Blvd, Queens, NY 11355, USA",NaN
1424,50139434,ChIJm2DLIFhhwokRRjOWuuTOzB4,Shanghai Eats,"4410 Kissena Blvd, Queens, NY 11355, USA",NaN
1425,50139434,ChIJ1TY27BRgwokRS60f42PdnyU,Tasty House 18,"4412 Kissena Blvd, Queens, NY 11355, USA",NaN
1426,50139652,ChIJW02aLKxNwokR9cbPUzyaouc,R a Deli,"2180 Forest Ave, Staten Island, NY 10303, USA",NaN
1427,50139652,ChIJp1STMqxNwokR89r1EZ9plQs,DOMINICAN FOOD CORP.,"2180 Forest Ave, Staten Island, NY 10303, USA",NaN

In [12]:
unique_camis = places_df.camis.unique()

In [13]:
type(unique_camis)

numpy.ndarray

In [3]:
places_df.head(2)

,camis,place_id,display_name,formatted_address,note
0,41168748,ChIJNzTkzav1wokRg3R8aGzuiWI,Dunkin',"In Sunoco Gas Station, 880 Garrison Ave, Bronx...",NaN
1,41688142,ChIJN0LWs0VawokRlblPt3vRdBU,Table 87,"87 Atlantic Ave, Brooklyn, NY 11201, USA",NaN

In [4]:
places_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9421 entries, 0 to 9420
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   camis              9421 non-null   int64
 1   place_id           9421 non-null   object
 2   display_name       9421 non-null   object
 3   formatted_address  9421 non-null   object
 4   note               498 non-null    object
dtypes: int64(1), object(4)
memory usage: 368.1+ KB

In [5]:
places_df.camis.nunique()

6589

In [6]:
len(places_df)

9421

In [8]:
len(places_df) - places_df.camis.nunique()

2832

In [17]:
len(places_df[places_df.note.isna()])

8923

In [26]:
places_df = places_df.drop_duplicates()

In [28]:
places_df.shape

(7695, 5)

In [18]:
places_df = places_df[places_df.note.isna()]
places_df.shape

(8923, 5)